Model: "fcnn4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape_1 (Reshape)          (None, 96, 1366, 1)       0         
_________________________________________________________________
zero_padding2d_1 (ZeroPaddin (None, 96, 1440, 1)       0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 96, 1440, 1)       4         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 96, 1440, 32)      320       
_________________________________________________________________
batch_normalization_2 (Batch (None, 96, 1440, 32)      128       
_________________________________________________________________
elu_1 (ELU)                  (None, 96, 1440, 32)      0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 48, 288, 32)       0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 48, 288, 32)       0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 48, 288, 64)       18496     
_________________________________________________________________
batch_normalization_3 (Batch (None, 48, 288, 64)       256       
_________________________________________________________________
elu_2 (ELU)                  (None, 48, 288, 64)       0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 16, 48, 64)        0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 16, 48, 64)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 16, 48, 128)       73856     
_________________________________________________________________
batch_normalization_4 (Batch (None, 16, 48, 128)       512       
_________________________________________________________________
elu_3 (ELU)                  (None, 16, 48, 128)       0         
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 4, 8, 128)         0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 4, 8, 128)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 4, 8, 256)         295168    
_________________________________________________________________
batch_normalization_5 (Batch (None, 4, 8, 256)         1024      
_________________________________________________________________
elu_4 (ELU)                  (None, 4, 8, 256)         0         
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 1, 1, 256)         0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 1, 1, 256)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 256)               0         
_________________________________________________________________
batch_normalization_6 (Batch (None, 256)               1024      
_________________________________________________________________
dropout_5 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 50)                12850     
=================================================================
Total params: 403,638
Trainable params: 402,164
Non-trainable params: 1,474
_________________________________________________________________
