Model: "crnn6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape_1 (Reshape)          (None, 96, 1366, 1)       0         
_________________________________________________________________
zero_padding2d_1 (ZeroPaddin (None, 96, 1440, 1)       0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 96, 1440, 1)       4         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 96, 1440, 32)      320       
_________________________________________________________________
batch_normalization_2 (Batch (None, 96, 1440, 32)      128       
_________________________________________________________________
elu_1 (ELU)                  (None, 96, 1440, 32)      0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 48, 720, 32)       0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 48, 720, 32)       0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 48, 720, 64)       18496     
_________________________________________________________________
batch_normalization_3 (Batch (None, 48, 720, 64)       256       
_________________________________________________________________
elu_2 (ELU)                  (None, 48, 720, 64)       0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 24, 360, 64)       0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 24, 360, 64)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 24, 360, 128)      73856     
_________________________________________________________________
batch_normalization_4 (Batch (None, 24, 360, 128)      512       
_________________________________________________________________
elu_3 (ELU)                  (None, 24, 360, 128)      0         
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 12, 120, 128)      0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 12, 120, 128)      0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 12, 120, 256)      295168    
_________________________________________________________________
batch_normalization_5 (Batch (None, 12, 120, 256)      1024      
_________________________________________________________________
elu_4 (ELU)                  (None, 12, 120, 256)      0         
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 6, 30, 256)        0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 6, 30, 256)        0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 6, 30, 512)        1180160   
_________________________________________________________________
batch_normalization_6 (Batch (None, 6, 30, 512)        2048      
_________________________________________________________________
elu_5 (ELU)                  (None, 6, 30, 512)        0         
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 3, 6, 512)         0         
_________________________________________________________________
dropout_5 (Dropout)          (None, 3, 6, 512)         0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 3, 6, 1024)        4719616   
_________________________________________________________________
batch_normalization_7 (Batch (None, 3, 6, 1024)        4096      
_________________________________________________________________
elu_6 (ELU)                  (None, 3, 6, 1024)        0         
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 1, 1, 1024)        0         
_________________________________________________________________
dropout_6 (Dropout)          (None, 1, 1, 1024)        0         
_________________________________________________________________
reshape_2 (Reshape)          (None, 1, 1024)           0         
_________________________________________________________________
gru_1 (GRU)                  (None, 1, 256)            983808    
_________________________________________________________________
gru_2 (GRU)                  (None, 256)               393984    
_________________________________________________________________
dropout_7 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 50)                12850     
=================================================================
Total params: 7,686,326
Trainable params: 7,682,292
Non-trainable params: 4,034
_________________________________________________________________
