Model: "fcnn5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape_1 (Reshape)          (None, 96, 1366, 1)       0         
_________________________________________________________________
zero_padding2d_1 (ZeroPaddin (None, 96, 1440, 1)       0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 96, 1440, 1)       4         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 96, 1440, 32)      320       
_________________________________________________________________
batch_normalization_2 (Batch (None, 96, 1440, 32)      128       
_________________________________________________________________
elu_1 (ELU)                  (None, 96, 1440, 32)      0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 48, 720, 32)       0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 48, 720, 32)       0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 48, 720, 64)       18496     
_________________________________________________________________
batch_normalization_3 (Batch (None, 48, 720, 64)       256       
_________________________________________________________________
elu_2 (ELU)                  (None, 48, 720, 64)       0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 24, 180, 64)       0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 24, 180, 64)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 24, 180, 128)      73856     
_________________________________________________________________
batch_normalization_4 (Batch (None, 24, 180, 128)      512       
_________________________________________________________________
elu_3 (ELU)                  (None, 24, 180, 128)      0         
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 12, 36, 128)       0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 12, 36, 128)       0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 12, 36, 256)       295168    
_________________________________________________________________
batch_normalization_5 (Batch (None, 12, 36, 256)       1024      
_________________________________________________________________
elu_4 (ELU)                  (None, 12, 36, 256)       0         
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 4, 6, 256)         0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 4, 6, 256)         0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 4, 6, 512)         1180160   
_________________________________________________________________
batch_normalization_6 (Batch (None, 4, 6, 512)         2048      
_________________________________________________________________
elu_5 (ELU)                  (None, 4, 6, 512)         0         
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 1, 1, 512)         0         
_________________________________________________________________
dropout_5 (Dropout)          (None, 1, 1, 512)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 512)               0         
_________________________________________________________________
batch_normalization_7 (Batch (None, 512)               2048      
_________________________________________________________________
dropout_6 (Dropout)          (None, 512)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 100)               51300     
=================================================================
Total params: 1,625,320
Trainable params: 1,622,310
Non-trainable params: 3,010
_________________________________________________________________
