Model: "fcnn3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape_1 (Reshape)          (None, 96, 1366, 1)       0         
_________________________________________________________________
zero_padding2d_1 (ZeroPaddin (None, 96, 1440, 1)       0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 96, 1440, 1)       4         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 96, 1440, 32)      320       
_________________________________________________________________
batch_normalization_2 (Batch (None, 96, 1440, 32)      128       
_________________________________________________________________
elu_1 (ELU)                  (None, 96, 1440, 32)      0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 24, 180, 32)       0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 24, 180, 32)       0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 24, 180, 64)       18496     
_________________________________________________________________
batch_normalization_3 (Batch (None, 24, 180, 64)       256       
_________________________________________________________________
elu_2 (ELU)                  (None, 24, 180, 64)       0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 6, 18, 64)         0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 6, 18, 64)         0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 6, 18, 128)        73856     
_________________________________________________________________
batch_normalization_4 (Batch (None, 6, 18, 128)        512       
_________________________________________________________________
elu_3 (ELU)                  (None, 6, 18, 128)        0         
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 1, 1, 128)         0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 1, 1, 128)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 128)               0         
_________________________________________________________________
batch_normalization_5 (Batch (None, 128)               512       
_________________________________________________________________
dropout_4 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 50)                6450      
=================================================================
Total params: 100,534
Trainable params: 99,828
Non-trainable params: 706
_________________________________________________________________
